{
  "backend/main.mo": "Main Motoko actor defining all data types (User, Pro, Booking, Notification, Transaction), stable storage with upgrade hooks, and access control via MixinAuthorization for a beauty-services booking platform on ICP.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their target files, component dependencies, test IDs, and confidence levels, covering LoginScreen loop fix, useAppState rewrite, App.tsx router, and more.",
  "frontend-file-summaries.txt": "JSON catalog of concise per-file summaries for all frontend source files, describing each component's purpose, props, and key design details.",
  "frontend/index.css": "Root CSS file importing Tailwind base/components/utilities and defining light and dark mode CSS custom property tokens for the design system (colors, radius, sidebar, charts).",
  "frontend/index.html": "Minimal HTML entry point for the NEXUS Vite/React app, mounting the React root at `#root` and loading `src/main.tsx` as a module.",
  "frontend/src/App.tsx": "Root React component that wires `useAppState` to a 28-case screen router, passes common props to all screen components, and renders Toast and NotifsPanel overlays.",
  "frontend/src/components/BottomSheet.tsx": "Reusable modal bottom sheet component with dark overlay, slide-up animation, drag handle, optional title header with close button, scrollable content, and optional sticky footer; adapts to a centered dialog on desktop (≥768px).",
  "frontend/src/components/BtnPrimary.tsx": "A reusable primary button component supporting loading, danger, small, and icon variants with press-scale animations and inline styles.",
  "frontend/src/components/Header.tsx": "App header component with back button or logo, optional centered title, role-switch button, and notifications bell with unread badge.",
  "frontend/src/components/icons/index.tsx": "Exports a collection of reusable SVG icon components (Flash, Search, Check, X, Bell, Radar, Wallet, Grid, Edit, etc.) with configurable size, color, and style props.",
  "frontend/src/components/NotifsPanel.tsx": "A slide-in notifications side panel that displays typed notifications with icons/colors and supports mark-all-read and close actions.",
  "frontend/src/components/ProgressCircle.tsx": "An SVG circular progress indicator that changes color based on progress value and displays the percentage as centered text.",
  "frontend/src/components/TabBarAdmin.tsx": "Bottom navigation tab bar for the admin role with four tabs: Dashboard, Pros, Bookings, and Revenue, highlighting the active screen.",
  "frontend/src/components/TabBarClient.tsx": "Bottom navigation tab bar for the client role with Explorer, Reservations, Alertes, and Profil tabs, including an unread notifications badge on Alertes.",
  "frontend/src/components/TabBarPro.tsx": "Renders a bottom navigation bar for the Pro interface with four tabs (Radar, Wallet, Accueil, Business), highlighting the active tab with a gold indicator and scale animation.",
  "frontend/src/components/Toast.tsx": "Displays a stack of dismissible toast notifications with type-specific icons and colors (success, error, info, sms, warning), using fade-in/slide animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient lifecycle, login/logout, identity persistence, and delegation validity checks.",
  "frontend/src/index.css": "Entry CSS file that imports the global stylesheet from styles/globals.css.",
  "frontend/src/lib/actor.ts": "Utility module for managing an AuthClient singleton and creating authenticated or anonymous ICP actors, with login, logout, and principal helper functions.",
  "frontend/src/lib/payrexx.ts": "Builds Payrexx TWINT payment URLs for Pro subscriptions (19.90 CHF/month) and one-time booking payments, encoding all required query parameters including redirect URLs and custom fields.",
  "frontend/src/lib/twilio.ts": "Stub module for Twilio SMS OTP integration with `sendOTP` and `verifyOTP` functions that log calls and simulate success in development.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/admin/AdminBookingsScreen.tsx": "Admin screen displaying a filterable list of demo bookings with status badges (pending, confirmed, completed, cancelled) and a bottom tab bar.",
  "frontend/src/screens/admin/AdminDashboardScreen.tsx": "Admin dashboard showing animated KPI counters, recent bookings, and a pending-pros validation panel fetched from the backend canister.",
  "frontend/src/screens/admin/AdminLoginScreen.tsx": "Admin login screen with email/password form that authenticates against hardcoded credentials and redirects to the admin dashboard on success.",
  "frontend/src/screens/admin/AdminProsScreen.tsx": "Admin screen listing professionals with status/city filters and validate/refuse actions, seeded with demo data and optionally populated from the backend.",
  "frontend/src/screens/admin/AdminRevenusScreen.tsx": "Admin revenue screen showing an animated monthly bar chart and a transaction list with total commissions summary.",
  "frontend/src/screens/auth/LoginScreen.tsx": "Landing login screen with animated background orbs, a glass-card UI, and a connect button that navigates to the role selection screen after an 800ms simulated delay.",
  "frontend/src/screens/auth/OTPScreen.tsx": "Two-step OTP authentication screen: first collects a Swiss phone number, then shows a 4-digit code input with auto-verify, resend countdown, and role-based navigation on success.",
  "frontend/src/screens/auth/RoleScreen.tsx": "Role selection screen presenting 'Client' and 'Pro' cards; sets the chosen role in global state and navigates to the OTP screen.",
  "frontend/src/screens/client/AlertesScreen.tsx": "Client notifications screen displaying demo alerts with type-specific icons and colors, supporting mark-as-read per item or all at once.",
  "frontend/src/screens/client/Booking1Screen.tsx": "First step of the client booking flow where the user selects a service from the pro's list; saves the selection to global state and advances to step 2.",
  "frontend/src/screens/client/Booking2Screen.tsx": "Step 2 of the booking flow where clients select a time slot (e.g., 'Dans 1 heure', 'Ce soir') from a predefined list, with flash availability badges, before proceeding to step 3.",
  "frontend/src/screens/client/Booking3Screen.tsx": "Step 3 of the booking flow that collects the client's service address, city (from a Swiss city dropdown), phone number, and optional notes, with validation before advancing to step 4.",
  "frontend/src/screens/client/Booking4Screen.tsx": "Step 4 of the booking flow displaying a summary recap card (professional, service, slot, address, total in CHF) and a confirm button that generates a booking ID and navigates to the processing screen.",
  "frontend/src/screens/client/Booking5Screen.tsx": "A processing/waiting screen shown after booking confirmation that displays an animated hourglass with a countdown progress bar, then auto-redirects to the live status screen after 8 seconds.",
  "frontend/src/screens/client/ClientProfilScreen.tsx": "The client profile screen allowing users to view and inline-edit their name, phone, and email, see payment history, and log out with a two-tap confirmation.",
  "frontend/src/screens/client/ExplorerScreen.tsx": "The main explorer/discovery screen listing demo beauty professionals (coiffure, esthétique, onglerie, massage) with filtering, ratings, flash availability, and navigation to pro detail and booking flows.",
  "frontend/src/screens/client/FicheProScreen.tsx": "Displays a professional's profile page with animated stats (bookings, rating, reviews), their services list, and reviews, allowing the client to book a service which navigates to the booking flow.",
  "frontend/src/screens/client/LiveStatusScreen.tsx": "Shows a real-time booking status screen with a 30-minute countdown timer, a step-by-step timeline, and booking summary, simulating pro confirmation after 6 seconds.",
  "frontend/src/screens/client/ReservationsScreen.tsx": "Displays the client's upcoming and completed bookings in a tabbed list with status badges and countdown chips for each reservation.",
  "frontend/src/screens/pro/ProBusinessScreen.tsx": "Multi-tab pro profile editor (Profil, Services, Tarifs, Galerie) with a progress circle score, tab completion tracking, and save/navigation logic for onboarding a professional.",
  "frontend/src/screens/pro/ProDashboardScreen.tsx": "Pro dashboard showing animated monthly metrics (appointments, revenue, rating), a flash mode toggle, and a greeting with today's date.",
  "frontend/src/screens/pro/ProRadarScreen.tsx": "Pro radar screen displaying pending booking requests, confirmed bookings, and history in a tabbed layout, with accept/decline actions that call the backend actor and show toast notifications.",
  "frontend/src/screens/pro/ProWalletScreen.tsx": "Pro wallet screen showing available balance, an animated weekly earnings bar chart, transaction history, and a bank transfer action with loading state.",
  "frontend/src/screens/pro/SubscriptionModal.tsx": "Subscription modal presenting NEXUS Pro plan benefits and a 7-day free trial offer, redirecting to Payrexx payment or activating the pro account locally if no payment secret is configured.",
  "frontend/src/screens/pro/SuccessScreen.tsx": "Post-subscription success screen with a confetti animation, animated progress bar, and a checkmark reveal, then a CTA to navigate to the pro dashboard.",
  "frontend/src/screens/pro/tabs/ServiceEditor.tsx": "Bottom-sheet form for creating or editing a pro service, with fields for name, price, duration, description, badge, and delivery mode.",
  "frontend/src/screens/pro/tabs/TabGalerie.tsx": "Gallery tab allowing pros to upload up to four profile photos via a 2x2 grid, with a progress bar, minimum-photo validation, and photo tips.",
  "frontend/src/screens/pro/tabs/TabPaiement.tsx": "React tab component for managing pro payment settings (TWINT phone number and Swiss IBAN), with inline validation, formatted display, and a financial summary section showing commission and subscription details.",
  "frontend/src/screens/pro/tabs/TabProfil.tsx": "React tab component for editing a pro's profile information including name, slogan, bio (200-char limit), service category, intervention location type, city, and salon address.",
  "frontend/src/screens/pro/tabs/TabServices.tsx": "React tab component for managing a pro's service list, with category-based defaults, support for adding/editing/deleting services via a ServiceEditor modal, and reordering/toggling active state.",
  "frontend/src/screens/pro/tabs/TabTarifs.tsx": "React tab component for configuring a pro's availability schedule (per-day time ranges), flash mode with supplement pricing, minimum booking delay, and cancellation policy.",
  "frontend/src/state/useAppState.ts": "Central application state hook defining all TypeScript interfaces (screens, roles, toasts, notifications, booking data, pro data) and the global state shape with initial defaults for the entire app.",
  "frontend/src/styles/globals.css": "Global CSS file defining the dark design system with CSS custom properties (color palette, spacing, layout vars), reset rules, typography, form/button base styles, layout utilities (screen-root, scroll-zone, cta-zone), and keyframe animations.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both query strings and hash-based routing, with helpers for persisting values to/from sessionStorage and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Inter font, oklch-based semantic color tokens, custom border radii, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (v25) documenting NEXUS v8.0 architecture decisions, known bugs (auth loop, OTP/role screen issues, layout overflow), and a registry of implemented features for the Swiss beauty marketplace built on ICP/Motoko with TWINT payments."
}