{
  "backend/main.mo": "Main Motoko actor for the NEXUS backend defining all data types (User, Pro, Booking, etc.), stable storage with upgrade hooks, and access control via MixinAuthorization. Implements the full business logic for users, professionals, bookings, notifications, and transactions on the Internet Computer.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, affected files, components, and test IDs. Covers the subscription price update from 19.90 to 29.90 CHF and the creation of the ProPitchScreen conversion landing page.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key implementation details, serving as a reference index for the frontend codebase structure and component responsibilities.",
  "frontend/index.css": "Root CSS entry point that imports Tailwind base/components/utilities and defines the full set of CSS custom property design tokens for both light and dark themes including colors, radius, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML shell for the NEXUS Vite/React app, mounting the React root at `#root` and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that manages screen routing via a switch on `state.screen`, renders a collapsible desktop sidebar with localStorage persistence, and passes shared props (go, update, showToast) to all 28+ screen components.",
  "frontend/src/components/BottomSheet.tsx": "Reusable modal bottom sheet component with a dark overlay, slide-up animation, drag handle, optional title header with close button, scrollable content area, and a sticky footer; adapts to a centered dialog on desktop via media query.",
  "frontend/src/components/BtnPrimary.tsx": "A reusable primary button component supporting loading, danger, small, and icon variants with press-scale animations and inline styles.",
  "frontend/src/components/Header.tsx": "App header component with back button or logo, optional centered title, role-switch button, and notifications bell with unread badge.",
  "frontend/src/components/icons/index.tsx": "Exports a collection of reusable SVG icon components (Flash, Search, Check, X, Bell, Radar, Wallet, Grid, Edit, etc.) with configurable size, color, and style props.",
  "frontend/src/components/NotifsPanel.tsx": "Slide-in notifications panel displaying a list of typed notifications with icons, unread count badge, and a mark-all-read action.",
  "frontend/src/components/ProgressCircle.tsx": "SVG circular progress indicator that changes color based on progress value and displays the percentage as centered text.",
  "frontend/src/components/TabBarAdmin.tsx": "Bottom tab bar for the admin role with four navigation tabs (Dashboard, Pros, RDV, Revenus) and an active-state indicator.",
  "frontend/src/components/TabBarClient.tsx": "Bottom tab bar for the client role with four tabs (Explorer, Reservations, Alertes, Profil) including an unread notifications badge on the Alertes tab.",
  "frontend/src/components/TabBarPro.tsx": "Renders a mobile bottom navigation bar for the Pro interface with four tabs (Radar, Wallet, Accueil, Business), highlighting the active tab with a gold indicator and scale animation.",
  "frontend/src/components/Toast.tsx": "Displays a stack of dismissible toast notifications with type-specific icons and colors (success, error, info, sms, warning), using fade-in/slide animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient lifecycle, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/index.css": "Entry CSS file that imports the global stylesheet from styles/globals.css.",
  "frontend/src/lib/actor.ts": "Utility module wrapping Dfinity AuthClient and Agent to provide login, logout, authentication status checks, and generic ICP actor creation with optional identity.",
  "frontend/src/lib/payrexx.ts": "Builds Payrexx payment URLs for TWINT-based Pro subscription and one-time booking payments, encoding all required query parameters including redirect URLs and custom fields.",
  "frontend/src/lib/twilio.ts": "Stub module for Twilio SMS OTP integration with `sendOTP` and `verifyOTP` functions that log calls and simulate success in development.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/admin/AdminBookingsScreen.tsx": "Admin screen displaying a filterable list of demo bookings with status badges (pending, confirmed, completed, cancelled) and a bottom tab bar.",
  "frontend/src/screens/admin/AdminDashboardScreen.tsx": "Admin dashboard showing animated KPI counters, recent bookings, and a pending-pros validation list fetched from the backend canister.",
  "frontend/src/screens/admin/AdminLoginScreen.tsx": "Admin login screen with email/password form that authenticates against hardcoded credentials and redirects to the admin dashboard on success.",
  "frontend/src/screens/admin/AdminProsScreen.tsx": "Admin screen listing professionals with status/city filters, validate/refuse actions, and data fetched from the backend canister with demo fallback.",
  "frontend/src/screens/admin/AdminRevenusScreen.tsx": "Admin revenue screen showing an animated monthly bar chart and a transaction list with commission and subscription totals.",
  "frontend/src/screens/auth/LoginScreen.tsx": "Landing login screen with animated background orbs, a glass-card UI, and a connect button that navigates to the role selection screen after a short delay.",
  "frontend/src/screens/auth/OTPScreen.tsx": "Two-step OTP authentication screen: first collects a Swiss phone number, then presents a 4-digit code input with auto-verify and resend countdown.",
  "frontend/src/screens/auth/RoleScreen.tsx": "Role selection screen where the user picks either 'client' or 'pro', stores the choice in global state, and navigates to the OTP screen.",
  "frontend/src/screens/client/AlertesScreen.tsx": "Client notifications screen displaying demo alerts with type-specific icons and colors, supporting mark-as-read per item or all at once.",
  "frontend/src/screens/client/Booking1Screen.tsx": "First step of the client booking flow where the user selects a service from the chosen pro's list, with a step indicator and navigation to booking step 2.",
  "frontend/src/screens/client/Booking2Screen.tsx": "Step 2 of the booking flow where clients select a time slot (e.g., 'Dans 1 heure', 'Ce soir') from a predefined list, with flash availability badges, and advances to booking step 3.",
  "frontend/src/screens/client/Booking3Screen.tsx": "Step 3 of the booking flow that collects the client's address, city (from a Swiss city dropdown), phone number, and optional notes before advancing to step 4.",
  "frontend/src/screens/client/Booking4Screen.tsx": "Step 4 of the booking flow displaying a summary recap card (professional, service, slot, address, total in CHF) and a confirm button that generates a booking ID and navigates to the processing screen.",
  "frontend/src/screens/client/Booking5Screen.tsx": "Booking processing/confirmation screen that shows an animated hourglass with a progress bar and auto-redirects to the live status screen after an 8-second countdown.",
  "frontend/src/screens/client/ClientProfilScreen.tsx": "Client profile screen allowing users to view and inline-edit their name, phone, and email, see payment history, and log out with a two-tap confirmation.",
  "frontend/src/screens/client/ExplorerScreen.tsx": "Explorer screen displaying a filterable list of demo beauty/wellness professionals (coiffure, esthétique, onglerie, massage) with ratings, pricing, and flash availability for clients to browse and select.",
  "frontend/src/screens/client/FicheProScreen.tsx": "Displays a professional's profile page with animated stats (bookings, rating, reviews), their services list, and reviews, allowing clients to initiate a booking for a selected service.",
  "frontend/src/screens/client/LiveStatusScreen.tsx": "Shows a real-time booking status screen with a 30-minute countdown timer, a step-by-step timeline, and simulates pro confirmation after 6 seconds.",
  "frontend/src/screens/client/ReservationsScreen.tsx": "Renders a client reservations screen with tabbed views for upcoming and completed bookings, displaying status badges and countdown chips for each booking.",
  "frontend/src/screens/pro/ProBusinessScreen.tsx": "Pro profile management screen with tabbed sections (Profil, Services, Tarifs, Galerie), a profile completion progress indicator, share pill, and network referral row.",
  "frontend/src/screens/pro/ProDashboardScreen.tsx": "Pro dashboard showing animated monthly metrics (appointments, revenue, rating), a flash mode toggle, greeting with today's date, and navigation to notifications and profile sharing.",
  "frontend/src/screens/pro/ProNetworkScreen.tsx": "Displays the pro's referral network screen, showing a copyable referral code and a list of referred professionals with their status (active/pending).",
  "frontend/src/screens/pro/ProPitchScreen.tsx": "Marketing/onboarding pitch screen for professionals, featuring animated orbs, an animated counter of 500+ pros, value proposition pillars, and testimonials.",
  "frontend/src/screens/pro/ProRadarScreen.tsx": "Pro booking management screen with three tabs (pending, confirmed, history) that lets pros accept or decline booking requests, calling the actor API and updating local state.",
  "frontend/src/screens/pro/ProShareScreen.tsx": "Screen for sharing a pro's profile link via a generated QR code, clipboard copy, WhatsApp, SMS, or Instagram bio.",
  "frontend/src/screens/pro/ProStatsScreen.tsx": "Statistics dashboard for pros showing revenue by service category, a booking heatmap by day/hour, top clients, and an animated rating trend line chart.",
  "frontend/src/screens/pro/ProWalletScreen.tsx": "Pro wallet screen displaying available balance, an animated bar chart of weekly earnings, and a transaction history list, with a bank transfer action that validates minimum balance.",
  "frontend/src/screens/pro/SubscriptionModal.tsx": "Subscription modal presenting NEXUS Pro plan features and pricing (7-day free trial then 29.90 CHF/month), redirecting to Payrexx payment or activating pro mode directly if no payment secret is configured.",
  "frontend/src/screens/pro/SuccessScreen.tsx": "Post-subscription success screen with an animated progress bar, confetti effect, and checkmark animation, prompting the user to access their pro dashboard.",
  "frontend/src/screens/pro/tabs/ServiceEditor.tsx": "Bottom sheet form for creating or editing a pro service, with fields for name, price, duration, description, badge, and delivery mode.",
  "frontend/src/screens/pro/tabs/TabGalerie.tsx": "Gallery tab allowing pros to upload up to 4 profile photos in a 2x2 grid, with a progress bar, minimum photo requirement warning, and photo tips.",
  "frontend/src/screens/pro/tabs/TabPaiement.tsx": "Payment settings tab for pros to enter and validate their TWINT phone number and Swiss IBAN, with live validation feedback and a financial summary of NEXUS fees.",
  "frontend/src/screens/pro/tabs/TabProfil.tsx": "A form tab component for editing a professional's profile, including fields for name, slogan, bio, category, location type, service radius, salon address, and city.",
  "frontend/src/screens/pro/tabs/TabServices.tsx": "A tab component for managing a professional's service list, supporting add/edit/delete/reorder operations with category-specific default services and a ServiceEditor sub-component.",
  "frontend/src/screens/pro/tabs/TabTarifs.tsx": "A tab component for configuring a professional's availability schedule (days and hours), Flash mode with supplement pricing, minimum booking delay, and cancellation policy.",
  "frontend/src/state/useAppState.ts": "Defines the global application state shape, types (screens, roles, toasts, notifications, booking data, pro data), and a custom hook managing state and actions for the entire app.",
  "frontend/src/styles/globals.css": "Global CSS file defining design tokens (CSS variables), reset rules, layout utilities, typography, form element styles, button base styles, glass card component, and keyframe animations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark design system with oklch-based color tokens, Inter font, custom border radii, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state document (v29) describing NEXUS v8.0, a Swiss beauty/wellness marketplace built with React 18 TypeScript, ICP Motoko backend, TWINT payments, and tracking architectural rules, known bugs, and implemented features."
}