{
  "backend/main.mo": "Main Motoko actor for the NEXUS backend defining data types (User, Pro, Booking, Notification, Transaction), stable storage with upgrade hooks, and access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to specific implementation requirements and test IDs for ExplorerScreen routing, App.tsx switch cases, and ExplorerScreen layout/behavior.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering styles, icons, state management, auth utilities, payment helpers, and UI components.",
  "frontend/index.css": "Tailwind CSS entry file with full light/dark CSS custom property tokens for background, foreground, card, sidebar, chart colors, and border radius.",
  "frontend/index.html": "Minimal HTML shell for the NEXUS React app, mounting to a #root div and loading src/main.tsx as an ES module.",
  "frontend/src/App.tsx": "Root React component that drives screen routing via a switch on state.screen, manages a toast notification system, and renders all 28 screens including placeholders for unimplemented routes.",
  "frontend/src/components/BottomSheet.tsx": "Modal bottom sheet component with a blurred overlay, slide-up animation, drag handle, optional title/close button, scrollable content area, and safe-area footer padding.",
  "frontend/src/components/BtnPrimary.tsx": "Reusable primary button component supporting gold gradient, danger, disabled, loading spinner, small variant, and icon slot styles.",
  "frontend/src/components/Header.tsx": "Renders a fixed top navigation bar with a logo or back button on the left, an optional centered title, and role-switch/notification buttons on the right.",
  "frontend/src/components/icons/index.tsx": "Exports a collection of reusable SVG icon components (Flash, Search, Check, X, Bell, Radar, Wallet, Grid, Edit, etc.) with configurable size and color props.",
  "frontend/src/components/NotifsPanel.tsx": "Slide-in right panel that displays a list of app notifications with timestamps, unread indicators, and a mark-all-read action.",
  "frontend/src/components/ProgressCircle.tsx": "SVG circular progress indicator that changes color based on completion percentage (red/gold/green) and displays the percentage value in the center.",
  "frontend/src/components/TabBarAdmin.tsx": "Bottom tab bar for the admin role with four tabs: Dashboard, Pros, RDV, and Revenus, highlighting the active tab in red.",
  "frontend/src/components/TabBarPro.tsx": "Bottom tab bar for the pro role with four tabs: Radar, Wallet, Accueil, and Profil, highlighting the active tab in gold.",
  "frontend/src/components/Toast.tsx": "Renders a stack of auto-dismissing toast notifications (after 3 seconds) with color-coded left borders based on type (success, error, info, warning).",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and persisted identity state via AuthClient.",
  "frontend/src/index.css": "Entry CSS file that imports the global stylesheet.",
  "frontend/src/lib/actor.ts": "Utility module for managing an AuthClient singleton and creating authenticated or anonymous ICP actors, with login, logout, and identity helper functions.",
  "frontend/src/lib/payrexx.ts": "Builds Payrexx payment URLs for TWINT-based subscription and one-time booking payments, constructing query strings from environment-configured instance and secret values.",
  "frontend/src/lib/twilio.ts": "Stub module for Twilio SMS OTP integration that logs calls and simulates sending and verifying 4-digit OTP codes, intended to be replaced with real API proxy calls.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/screens/admin/AdminBookingsScreen.tsx": "Admin screen displaying a filterable list of mock bookings with status badges, counts, and a tab bar for admin navigation.",
  "frontend/src/screens/admin/AdminDashboardScreen.tsx": "Admin dashboard screen showing animated KPI counters, recent bookings, and a list of pending pros fetched from the backend actor, with validate/refuse actions and logout functionality.",
  "frontend/src/screens/admin/AdminLoginScreen.tsx": "Admin login screen with email/password fields that authenticates against hardcoded credentials and navigates to the admin dashboard on success.",
  "frontend/src/screens/admin/AdminProsScreen.tsx": "Admin screen listing professionals fetched from the backend actor, with status and city filters, and actions to validate or refuse pending pros.",
  "frontend/src/screens/admin/AdminRevenusScreen.tsx": "Admin revenue screen displaying static monthly bar chart data and a list of mock transactions for commissions and subscriptions.",
  "frontend/src/screens/auth/LoginScreen.tsx": "User login screen using Internet Identity, with animated background orbs and a connect button that navigates to role selection on success.",
  "frontend/src/screens/auth/OTPScreen.tsx": "SMS OTP verification screen that validates a Swiss phone number, sends a code via Twilio, and routes the user to the appropriate dashboard after successful verification.",
  "frontend/src/screens/auth/RoleScreen.tsx": "Role selection screen presenting client and pro profile cards, setting the chosen role in global state and navigating to the OTP screen.",
  "frontend/src/screens/client/Booking1Screen.tsx": "Step 1 of a 4-step booking flow where the client selects a service (e.g., haircut, beard trim) from a hardcoded list, then advances to step 2. Includes a reusable ProgressNodes component showing the current step.",
  "frontend/src/screens/client/Booking2Screen.tsx": "Step 2 of the booking flow where the client selects an available time slot (today or tomorrow), generated dynamically based on the current time. Saves the chosen date/time to global state and navigates to step 3.",
  "frontend/src/screens/client/Booking3Screen.tsx": "Step 3 of the booking flow that collects the client's contact details (phone, address, city, optional note) for the pro's home visit. Validates required fields before advancing to the confirmation screen.",
  "frontend/src/screens/client/Booking4Screen.tsx": "Step 4 (confirmation/payment) of the booking flow that displays a summary of the selected service, date, and address, then initiates a Payrexx payment redirect via TWINT. Navigates to booking_confirm before redirecting.",
  "frontend/src/screens/client/ExplorerScreen.tsx": "Explorer screen displaying a filterable list of demo beauty/barber professionals with cards showing ratings, pricing, and flash availability. Supports category and flash filters with a search bar UI.",
  "frontend/src/screens/client/FicheProScreen.tsx": "Displays a detailed professional profile page for clients, showing a cover image, category badge, star rating, mock services list, and a booking CTA, with a back button navigating to the explorer screen.",
  "frontend/src/screens/pro/ProBusinessScreen.tsx": "Multi-tab pro profile setup screen (Profil, Services, Tarifs, Paiement, Galerie) with a progress score calculator and save/activate actions that route to the subscription screen.",
  "frontend/src/screens/pro/ProDashboardScreen.tsx": "Pro dashboard home screen showing animated metrics (reservations, revenue, rating), a free-trial badge, and a Flash mode toggle that updates global state.",
  "frontend/src/screens/pro/ProRadarScreen.tsx": "Pro booking management screen with three tabs (pending, confirmed, history), countdown timers on pending requests, and accept/decline actions that call the ICP actor and update local state.",
  "frontend/src/screens/pro/ProWalletScreen.tsx": "Pro wallet screen displaying available balance, an animated weekly revenue bar chart, a transaction history list, and a cooldown-gated bank transfer button.",
  "frontend/src/screens/pro/SubscriptionModal.tsx": "Subscription upsell modal listing NEXUS Pro advantages and pricing (7-day free trial then 19.90 CHF/month), with a CTA that redirects to a Payrexx payment URL.",
  "frontend/src/screens/pro/SuccessScreen.tsx": "Displays a post-subscription success screen with animated confetti, a progress bar, and a checkmark, then navigates to the pro dashboard when the user taps the CTA button.",
  "frontend/src/screens/pro/tabs/ServiceEditor.tsx": "A bottom sheet form for creating or editing a pro service item, with fields for name, price, duration, description, badge, and intervention mode.",
  "frontend/src/screens/pro/tabs/TabGalerie.tsx": "A gallery tab that lets pros upload up to 4 portfolio photos via file input, shows a progress bar toward the 3-photo minimum, and displays photo tips.",
  "frontend/src/screens/pro/tabs/TabPaiement.tsx": "A payment settings tab with validated input fields for a Swiss TWINT phone number and IBAN, plus a financial summary showing commission and subscription details.",
  "frontend/src/screens/pro/tabs/TabProfil.tsx": "A profile editing tab with fields for name, slogan, bio, service category, intervention location, travel radius, and city selection for a pro account.",
  "frontend/src/screens/pro/tabs/TabServices.tsx": "A services management tab that pre-populates category-specific default services and allows pros to add, edit, reorder, toggle active state, and delete service items via the ServiceEditor sheet.",
  "frontend/src/screens/pro/tabs/TabTarifs.tsx": "React component for a pro's availability and pricing settings tab, allowing toggling active days with time ranges, configuring flash mode with a supplement, and selecting minimum delay and cancellation policy options.",
  "frontend/src/state/useAppState.ts": "Central React state hook defining all global app state types (screens, roles, toasts, bookings, notifications) and exposing `go` and `update` helpers for navigation and state mutation.",
  "frontend/src/styles/globals.css": "Global stylesheet importing Inter font, defining the full CSS custom property design palette, mobile reset rules, input/button styles, hidden scrollbars, and keyframe animations used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Inter font, oklch-based semantic color tokens, custom border radii, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (v13) documenting the NEXUS marketplace architecture, design constraints (no React Router, TWINT-only payments, ICP backend), known bugs, and a registry of implemented features."
}